{
  "intro": {
    "welcome": "Welcome to my portfolio!",
    "introduction": "I am a seasoned Software Developer with over {{number}} of hands-on experience across industries as diverse as HR Tech. and Healthcare.<br/><br/>Over the years, I have acquired in-depth expertise in the design and maintenance of complex systems, as well as in the creation of dynamic user interfaces.",
    "subsection": "Key Skills and Interests:",
    "software_architecture": "<strong>Software architecture:</strong> Passionate about designing software architectures that are not only scalable and efficient but also adhere to best practices and industry standards. I focus on creating modular and reusable code that facilitates easy maintenance and future enhancements.",
    "frontend_development": "<strong>Front-end development:</strong> Proficient in creating complex, interactive and animated user interfaces using modern frameworks like Angular and React.",
    "api_and_system_design": "<strong>API Design & System Design:</strong> Experienced in designing and implementing robust APIs that ensure efficient communication between different software components. I have a strong foundation in system design principles, enabling me to architect scalable and maintainable software solutions.",
    "ai_&_machine_learning": "<strong>AI & Machine Learning:</strong> Interested in the field of artificial intelligence and machine learning. I regularly monitor advances in these fields and the emergence of new AI/ML models. I'm learning how to integrate these systems into software applications to improve functionality and user experience."
  },
  "experiences_title": "Experiences",
  "experiences": {
    "job": "Software developer",
    "tasks_performed": "Tasks performed:",
    "docorga_stack": "<strong>04/2024 - Present</strong> - <i>Angular 16-19, NestJS, MongoDB, Typescript, RxJS</i>",
    "docorga_domain": "<strong>Public health & liberal health professions</strong><br /><i>Patient file management, online appointment booking with SMS reminders and waiting list, billing, online payments (Stripe), practice management, retrocession.</i>",
    "docorga_task_1": "Technological migration: maintaining a legacy stack with high technical debt while developing and modernizing an Angular stack. Reducing the bug amount. Refactoring and structuring development practices.",
    "docorga_task_2": "Technical debt reduction: migrating components to standalone and lazy-loading routes with a custom preloading strategy (reducing the size of the initial bundle by 65%). Adopting “OnPush” ChangeDetectionStrategy. Using advanced Angular signals (reactive development). Implementing unit and integrations tests to limit regression and detect bugs.",
    "docorga_task_3": "Architecture: introducing Domain-Driven Design to improve the structure of a large and complex business domain. Detecting and eliminating circular dependencies. Setting up stricter lint rules.",
    "docorga_task_4": "Soft skills: training of developers in Angular best practices and the latest framework developments. Conducting experience feedback meetings. Sharing technical resources and articles. Updating support materials and documentation.",
    "expateo_stack": "<strong>01/2020 - 03/2024</strong> - <i>Angular 7-14, Typescript, RxJS</i>",
    "expateo_domain": "<strong>International Mobility & Human Resources</strong><br /><i>Customizable dynamic forms with conditional fields, task management and personalized workflows, patient record management, CSV exports and backoffice.</i>",
    "expateo_task_1": "Back-end migration: contributed to the migration from PHP to Node.js/Express.js. Updated API connectors and modernized obsolete routes.",
    "expateo_task_2": "Front-end maintenance and upgrades: Maintained an Angular application from v7 to v17. Adopted best practices and set strict Linting and Prettier rules.",
    "expateo_task_3": "Architecture overhaul: updated a monolithic application to a modular monolith (feature modules) to prepare for a transition to a microservice architecture.",
    "expateo_task_4": "Development of a new application: created a complete responsive application, designed from scratch to enhance the product offering.",
    "wanao_stack": "<strong>11/2018 - 12/2019</strong> - <i>JavaScript, SQL, HTML, CSS, jQuery, D3.js</i>",
    "wanao_domain": "<strong>Public Tendering & Public Procurement</strong> <br /> <i> Detection, centralization, standardization, sorting with advanced filters and assistance in completing tender documents</i>",
    "wanao_task_1": "Legacy application redesign: modernized an application using uniGUI (Delphi) through a style overhaul with CSS overloading and integration of JavaScript scripts.",
    "wanao_task_2": "Dynamic interface development: created an advanced filter tree interface with D3.js, generating SQL queries and allowing filter import/export in JSON.",
    "wanao_task_3": "Interface migration: transcribed interfaces from native Delphi software into web interfaces, developed from scratch in HTML, CSS and JavaScript."
  },
  "side_projects_title": "Side projects",
  "formation_title": "Education",
  "formation": {
    "cnam_degree": "Engineer - Systems and Software Architecture and Engineering (AISL)",
    "cnam_infos": "<strong>(Ongoing) 2025</strong> - Scheduled completion 2030 Outside working hours at CNAM Nouvelle-Aquitaine, France",
    "cnam_hyperlink_text": "Information sheet",
    "cnam_details": "Training of 895h accessible with a Bac+2 and conducted over a 5-6 year period. To obtain the diploma, students must validate the required E.U.s, pass an oral exam and defend a dissertation. It provides skills in software architecture, systems and software engineering, application development and project management.",
    "bts_degree": "Advanced Technician Certificate (French equivalent) - IT Services for Organizations (SIO)",
    "bts_infos": " <strong>2018</strong> - Software Solutions and Business Applications option (SLAM) <br /> Lycée Saint-John Perse, Pau, France",
    "bts_task_1": "Web application design and programming.",
    "bts_task_2": "Java, Python, PHP, SQL, HTML/CSS, JavaScript language learning",
    "bts_task_3": "Understanding customer needs using analytical methods (MERISE, UML).",
    "bts_task_4": "Data model and relational database design.",
    "bts_task_5": "Project planning and monitoring using Agile and Scrum methodologies.",
    "bts_task_6": "Use of RDBMS such as PostgreSQL, MySQL and SQLite.",
    "bts_task_7": "Drafting of technical and functional documentation.",
    "bts_task_8": "Technology watch and adaptation to new tools, frameworks and development environments.",
    "bac_degree": "Scientific Baccalauréat",
    "bac_infos": "<strong>2016</strong> - Computer Science and Digital Science option (ISN) <br /> Lycée Louis Barthou, Pau, France",
    "bac_details": "Learning the basics of algorithms with Python 2.7 <br /> Realization of a project for the ISN option test at the Baccalauréat: simulation of a projectile firing under Earth's gravity, with variable force, mass and angle parameters."
  },
  "bookshelf_title": "My bookshelf",
  "book_clean_architecture_title": "Clean Architecture",
  "book_clean_architecture_txt": "Among other things, this book helped me understand that, while tools and languages in the software industry are evolving rapidly, the fundamental rules and best practices remain unchanged. I also learned that the quality of a software architecture can be measured by the effort required to meet user needs with each new version.",
  "book_artificial_intelligence_title": "Artificial Intelligence: A Guide for Thinking Humans",
  "book_artificial_intelligence_txt": "This book taught me the history of AI from the invention of convolutional neural networks to the rise of today's LLMs. It made me aware of the limits of the specialized AI we know today, but also of the difficulty of predicting the capabilities and/or incapacities of future models.",
  "book_ddd_title": "Domain Driven Design",
  "book_ddd_text": "This book has given me with a robust framework to handle complicated software projects, emphasizing the importance of understanding the domain, collaborating, communicating clearly, and refining iteratively.",
  "links_title": "Links",
  "links_devflix": "Portfolio with Netflix design"
}
