{
  "intro": {
    "welcome": "Bienvenue sur mon portfolio !",
    "introduction": "Je suis un développeur logiciels expérimenté avec plus de {{number}} d'éxpérience pratique dans des secteurs variés tels que les ressources humaines ou la santé.<br/><br/>Au fil des années, j'ai acquis une expertise approfondie dans la conception et la maintenance de systèmes complexe ainsi que dans la création d'interfaces utilisateur dynamiques.",
    "subsection": "Compétences clés et intérêts :",
    "software_architecture": "<strong>Architecture logicielle :</strong> Je suis passionné par la conception d'architectures logicielles qui sont non seulement évolutives et efficaces, mais qui respectent également les meilleures pratiques et les normes de l'industrie. Je me concentre sur la création d'un code modulaire et réutilisable qui facilite la maintenance et les améliorations futures.",
    "frontend_development": "<strong>Développement frontend :</strong> Je maîtrise la réalisation d'interfaces utilisateur complexes, interactives et animées grâce aux frameworks modernes comme Angular et React.",
    "api_and_system_design": "<strong>Conception d'API et de systèmes :</strong> J'ai de l'expérience dans la conception et la mise en œuvre d'API robustes qui garantissent une communication entre les différents composants logiciels. J'ai de solides bases en matière de principes de conception de systèmes, ce qui me permet d'élaborer des solutions logicielles évolutives et faciles à maintenir.",
    "ai_&_machine_learning": "<strong>Intelligence artificielle et apprentissage automatique :</strong> Je porte un intérêt pour le domaine de l'intelligence artificielle et l'apprentissage automatique. J'effectue une veille régulière sur les avancées dans ces domaines ainsi que de l'émergence de nouveaux modèles d'IA/ML. J'apprends les moyens d'intégrer ces systèmes dans des applications logicielles afin d'améliorer les fonctionnalités et l'expérience utilisateur."
  },
  "experiences_title": "Expériences",
  "experiences": {
    "job": "Développeur logiciel",
    "tasks_performed": "Tâches réalisées :",
    "docorga_stack": "<strong>04/2024 - Aujourd'hui</strong> - <i>Angular 16-19, NestJS, MongoDB, Typescript, RxJS</i>",
    "docorga_domain": "<strong>Santé publique & Professions de santé libérales</strong><br /><i>Gestion de dossier patients, prise de rendez-vous en ligne avec rappels SMS et liste d'attente, facturation, paiements en ligne (Stripe), gestion de cabinet, rétrocession.</i>",
    "docorga_task_1": "Migration technologique : Maintenance d'une stack legacy à forte dette technique tout en développant et modernisant une stack Angular. Réduction des bugs, refactorisations et structuration des pratiques de développement.",
    "docorga_task_2": "Réduction dette technique : Migration des composants en standalone et lazy-loading systématique des routes avec une stratégie de préchargement custom (Réduction de la taille du bundle initial de 65%), adoption du ChangeDetectionStrategy \"OnPush\", utilisation avancée des signaux (développement réactif). Implémentation de tests unitaires et d’intégrations pour limiter la régression et détecter des bugs.",
    "docorga_task_3": "Architecture : Introduction du Domain-Driven Design pour mieux structurer un domaine métier large et complexe. Détection et réduction des dépendances circulaires (front et back).",
    "docorga_task_4": "Soft skills : Formation des développeurs sur les bonnes pratiques Angular et les dernières nouveautés du framework, présentations de retours d’expérience. Mise à jour des supports et documentations.",
    "expateo_stack": "<strong>01/2020 - 03/2024</strong> - <i>Angular 7-14, Typescript, RxJS</i>",
    "expateo_domain": "<strong>Mobilité Internationale & Ressources Humaines</strong><br /><i>Formulaires dynamiques customisables avec champs conditionnels, gestion de tâches et de workflows personnalisés, gestion de dossier patients, exports CSV et backoffice</i>",
    "expateo_task_1": "Migration back-end : Contribution à la migration de PHP vers Node.js/Express.js, mise à jour des connecteurs API et modernisation des routes obsolètes.",
    "expateo_task_2": "Maintenance et mise à jour front-end : Maintenance une application Angular de la v7 à la v17, adoption de bonnes pratiques via des règles de lint et Prettier.",
    "expateo_task_3": "Refonte d’architecture : Refonte d'une application monolithique vers une architecture modulaire basée sur les feature modules.",
    "expateo_task_4": "Développement d'une nouvelle application : Création d'une application responsive complète, conçue from scratch pour enrichir l’offre produit.",
    "wanao_stack": "<strong>11/2018 - 12/2019</strong> - <i>JavaScript, SQL, HTML, CSS, jQuery, D3.js</i>",
    "wanao_domain": "<strong>Appels d'offres & marchés publics</strong> <br /> <i> Détection, centralisation, normalisation, tri avec filtres avancés et aide pour compléter les dossiers d'appels d'offres</i>",
    "wanao_task_1": "Refonte d’application legacy : Modernisation d'une application utilisant uniGUI (Delphi) à travers une refonte du style avec surcharge CSS et intégration de scripts JavaScript.",
    "wanao_task_2": "Développement d'interfaces dynamiques : Création d'une interface de filtres avancés en tree avec D3.js, générant des requêtes SQL et permettant l'import/export des filtres en JSON.",
    "wanao_task_3": "Migration d’interfaces : Transcription d'interfaces d’un logiciel natif Delphi en interfaces web, développées from scratch en HTML, CSS et JavaScript."
  },
  "side_projects_title": "Side projects",
  "formation_title": "Formation",
  "formation": {
    "cnam_degree": "Ingénieur Architecture et Ingénierie des Systèmes et des Logiciels (AISL)",
    "cnam_infos": "<strong>(En cours) 2025</strong> - Fin prévue 2030 Hors temps de travail au CNAM Nouvelle-Aquitaine",
    "cnam_hyperlink_text": "Fiche formation",
    "cnam_details": "Formation de 895h accessible avec un Bac+2 et réalisée sur une période de 5 à 6 ans. L'obtention du diplôme est conditionnée par la validation des U.E. nécessaires, l'évaluation par un jury lors d'un oral ainsi que la soutenance d'un mémoire. Elle permet d'acquérir des compétences en architecture logicielle, en ingénierie des systèmes et des logiciels, en développement d'applications et en gestion de projet.",
    "bts_degree": "B.T.S. Services Informatiques aux Organisations (SIO)",
    "bts_infos": " <strong>2018</strong> - option B Solutions Logicielles et Applications Métiers (SLAM) <br /> Lycée Saint-John Perse, Pau",
    "bts_task_1": "Conception et programmation d'applications web.",
    "bts_task_2": "Apprentissage des langages Java, Python, PHP, SQL, HTML/CSS, JavaScript",
    "bts_task_3": "Compréhension des besoins clients grâce à des méthodes d’analyse (MERISE, UML).",
    "bts_task_4": "Élaboration de modèles de données et conception de bases relationnelles.",
    "bts_task_5": "Planification et suivi de projets via les méthodologies Agile et Scrum.",
    "bts_task_6": "Utilisation de SGBDR comme PostgreSQL, MySQL et SQLite.",
    "bts_task_7": "Rédaction de documentations techniques et fonctionnelles.",
    "bts_task_8": "Veille technologique et adaptation aux nouveaux outils, frameworks et environnements de développement.",
    "bac_degree": "Baccalauréat Scientifique",
    "bac_infos": "<strong>2016</strong> - option Informatique et Sciences du Numérique (ISN) <br /> Lycée Louis Barthou, Pau",
    "bac_details": "Apprentissage des bases en algorithmique avec Python 2.7 <br /> Réalisation d'un projet dans le cadre de l'épreuve de l'option ISN au Baccalauréat : simulation d'un tir de projectile soumis à la gravité terrestre avec paramètres de force, masse et angle de tir variables."
  },
  "bookshelf_title": "Ma bibliothèque",
  "book_clean_architecture_title": "Clean Architecture",
  "book_clean_architecture_txt": "Ce livre m'a notamment permis de comprendre qu'au fil de l'évolution rapide des outils et des langages dans l'industrie du logiciel, les règles fondamentales et les bonnes pratiques, elles, demeurent inchangées. J'en retiens également que la qualité de l'architecture d'un logiciel peut se mesurer par l'effort requis pour répondre aux besoins des utilisateurs à chaque nouvelle version.",
  "book_artificial_intelligence_title": "Intelligence artificielle: Triomphes et Déceptions",
  "book_artificial_intelligence_txt": "Ce livre m'a appris l'histoire de l'IA depuis l'invention des réseaux de neurones convolutifs jusqu'à l'essort des LLM actuels. Il m'a fait prendre conscience des limites des IA spécialisées que nous connaissons aujourd'hui mais aussi de la difficulté de prédire les capacités et/ou incapacités des modèles futurs.",
  "book_ddd_title": "Domain Driven Design",
  "book_ddd_text": "Ce livre m'a fourni un cadre solide pour gérer des logiciels complexes, en soulignant l'importance de comprendre le domaine, de collaborer, de communiquer clairement et d'affiner de manière itérative.",
  "links_title": "Liens",
  "links_devflix": "Portfolio façon Netflix"
}
